In [2]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [9]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df.to_numpy()

array([[ 1.23128222,  0.09063597,  0.05877961,  1.09954397],
       [ 0.50440108,  1.20987118,  0.31021217, -0.51128328],
       [ 1.01405978, -0.36218825, -0.02130974,  0.95710994],
       [-1.47933541,  0.3965262 , -1.25540892,  1.37493113],
       [-0.68607437, -1.12707012, -1.34286053, -0.55428054],
       [-0.1972776 , -0.29178304, -1.9677762 ,  1.87505366]])

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.064509 -0.014001 -0.703061  0.706846
std    1.046124  0.789261  0.936573  1.010165
min   -1.479335 -1.127070 -1.967776 -0.554281
25%   -0.563875 -0.344587 -1.320998 -0.144185
50%    0.153562 -0.100574 -0.638359  1.028327
75%    0.886645  0.320054  0.038757  1.306084
max    1.231282  1.209871  0.310212  1.875054

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.231282    0.504401    1.014060   -1.479335   -0.686074   -0.197278
B    0.090636    1.209871   -0.362188    0.396526   -1.127070   -0.291783
C    0.058780    0.310212   -0.021310   -1.255409   -1.342861   -1.967776
D    1.099544   -0.511283    0.957110    1.374931   -0.554281    1.875054

In [15]:
df

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.099544  0.058780  0.090636  1.231282
2013-01-02 -0.511283  0.310212  1.209871  0.504401
2013-01-03  0.957110 -0.021310 -0.362188  1.014060
2013-01-04  1.374931 -1.255409  0.396526 -1.479335
2013-01-05 -0.554281 -1.342861 -1.127070 -0.686074
2013-01-06  1.875054 -1.967776 -0.291783 -0.197278

In [17]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [18]:
df.sort_values(by='D')

                   A         B         C         D
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [19]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  1.231282  0.090636
2013-01-02  0.504401  1.209871
2013-01-03  1.014060 -0.362188
2013-01-04 -1.479335  0.396526
2013-01-05 -0.686074 -1.127070
2013-01-06 -0.197278 -0.291783

In [20]:
df['A']

2013-01-01    1.231282
2013-01-02    0.504401
2013-01-03    1.014060
2013-01-04   -1.479335
2013-01-05   -0.686074
2013-01-06   -0.197278
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110

In [22]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931

In [23]:
df.loc[dates[0]]

A    1.231282
B    0.090636
C    0.058780
D    1.099544
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  1.231282  0.090636
2013-01-02  0.504401  1.209871
2013-01-03  1.014060 -0.362188
2013-01-04 -1.479335  0.396526
2013-01-05 -0.686074 -1.127070
2013-01-06 -0.197278 -0.291783

In [25]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.504401  1.209871
2013-01-03  1.014060 -0.362188
2013-01-04 -1.479335  0.396526

In [26]:
df.loc[dates[0], 'A']

1.231282220859091

In [27]:
df

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [28]:
df.loc[dates[1], 'A']

0.5044010765301904

In [29]:
df.at[dates[0], 'A']

1.231282220859091

In [30]:
 df.iloc[3]

A   -1.479335
B    0.396526
C   -1.255409
D    1.374931
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.479335  0.396526
2013-01-05 -0.686074 -1.127070

In [32]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.504401  0.310212
2013-01-03  1.014060 -0.021310
2013-01-05 -0.686074 -1.342861

In [33]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110

In [34]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.090636  0.058780
2013-01-02  1.209871  0.310212
2013-01-03 -0.362188 -0.021310
2013-01-04  0.396526 -1.255409
2013-01-05 -1.127070 -1.342861
2013-01-06 -0.291783 -1.967776

In [35]:
df.iloc[1, 1]

1.2098711826307524

In [36]:
df.iat[1, 1]

1.2098711826307524

In [37]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110

In [38]:
df[df['B'] > 0]

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-04 -1.479335  0.396526 -1.255409  1.374931

In [39]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212       NaN
2013-01-03  1.014060       NaN       NaN  0.957110
2013-01-04       NaN  0.396526       NaN  1.374931
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06       NaN       NaN       NaN  1.875054

In [40]:
df2 = df.copy()

In [41]:
df2

                   A         B         C         D
2013-01-01  1.231282  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [42]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [43]:
df2

                   A         B         C         D      E
2013-01-01  1.231282  0.090636  0.058780  1.099544    one
2013-01-02  0.504401  1.209871  0.310212 -0.511283    one
2013-01-03  1.014060 -0.362188 -0.021310  0.957110    two
2013-01-04 -1.479335  0.396526 -1.255409  1.374931  three
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281   four
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054  three

In [44]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.014060 -0.362188 -0.021310  0.957110   two
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281  four

In [45]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [46]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [47]:
df.at[dates[0], 'A'] = 0

In [48]:
df

                   A         B         C         D
2013-01-01  0.000000  0.090636  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [49]:
df.iat[0, 1] = 0

In [50]:
df

                   A         B         C         D
2013-01-01  0.000000  0.000000  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [51]:
df2 = df.copy()

In [52]:
df2[df2 > 0] = -df2

In [53]:
df2

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.058780 -1.099544
2013-01-02 -0.504401 -1.209871 -0.310212 -0.511283
2013-01-03 -1.014060 -0.362188 -0.021310 -0.957110
2013-01-04 -1.479335 -0.396526 -1.255409 -1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776 -1.875054

In [54]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [55]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [56]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0
2013-01-03  1.014060 -0.362188 -0.021310  0.957110  NaN
2013-01-04 -1.479335  0.396526 -1.255409  1.374931  NaN

In [57]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0

In [58]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0
2013-01-03  1.014060 -0.362188 -0.021310  0.957110  NaN
2013-01-04 -1.479335  0.396526 -1.255409  1.374931  NaN

In [59]:
df3 = df1.dropna(how='any')

df3

In [60]:
df3

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0

In [61]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [62]:
df1

                   A         B         C         D   E
2013-01-01  0.000000  0.000000  0.058780  1.099544 NaN
2013-01-02  0.504401  1.209871  0.310212 -0.511283 NaN
2013-01-03  1.014060 -0.362188 -0.021310  0.957110 NaN
2013-01-04 -1.479335  0.396526 -1.255409  1.374931 NaN

In [63]:
df3

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0

In [64]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [65]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0
2013-01-03  1.014060 -0.362188 -0.021310  0.957110  NaN
2013-01-04 -1.479335  0.396526 -1.255409  1.374931  NaN

In [66]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0
2013-01-03  1.014060 -0.362188 -0.021310  0.957110  5.0
2013-01-04 -1.479335  0.396526 -1.255409  1.374931  5.0

In [67]:
df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000  0.058780  1.099544  1.0
2013-01-02  0.504401  1.209871  0.310212 -0.511283  1.0
2013-01-03  1.014060 -0.362188 -0.021310  0.957110  NaN
2013-01-04 -1.479335  0.396526 -1.255409  1.374931  NaN

In [68]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [69]:
df.mean()

A   -0.140704
B   -0.029107
C   -0.703061
D    0.706846
dtype: float64

In [70]:
df.mean(1)

2013-01-01    0.289581
2013-01-02    0.378300
2013-01-03    0.396918
2013-01-04   -0.240822
2013-01-05   -0.927571
2013-01-06   -0.145446
Freq: D, dtype: float64

In [71]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [72]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [73]:
df.sub(s, axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.014060 -1.362188 -1.021310 -0.042890
2013-01-04 -4.479335 -2.603474 -4.255409 -1.625069
2013-01-05 -5.686074 -6.127070 -6.342861 -5.554281
2013-01-06       NaN       NaN       NaN       NaN

In [74]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.000000  0.000000  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.368992  0.588261
2013-01-03  1.518461  0.847683  0.347682  1.545371
2013-01-04  0.039125  1.244209 -0.907727  2.920302
2013-01-05 -0.646949  0.117139 -2.250587  2.366021
2013-01-06 -0.844227 -0.174644 -4.218364  4.241075

In [75]:
df.apply(lambda x: x.max() - x.min())

A    2.493395
B    2.336941
C    2.277988
D    2.429334
dtype: float64

In [76]:
df

                   A         B         C         D
2013-01-01  0.000000  0.000000  0.058780  1.099544
2013-01-02  0.504401  1.209871  0.310212 -0.511283
2013-01-03  1.014060 -0.362188 -0.021310  0.957110
2013-01-04 -1.479335  0.396526 -1.255409  1.374931
2013-01-05 -0.686074 -1.127070 -1.342861 -0.554281
2013-01-06 -0.197278 -0.291783 -1.967776  1.875054

In [77]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [78]:
s

0    1
1    0
2    4
3    4
4    3
5    5
6    3
7    3
8    1
9    1
dtype: int64

In [79]:
s.value_counts()

3    3
1    3
4    2
5    1
0    1
dtype: int64

In [80]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [81]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [82]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [83]:
df = pd.DataFrame(np.random.randn(10, 4))

In [84]:
df

          0         1         2         3
0  0.950582  0.183881  2.250567 -0.811921
1 -0.235128  0.791553 -0.625883 -1.725348
2 -0.907841  0.326129 -1.597208  0.110478
3 -0.631452 -0.518095 -0.728823 -0.177952
4 -1.335542  1.983912 -0.679510 -0.808348
5  0.007559  0.362327  0.396538 -0.456718
6  0.923302 -1.345448 -0.190447  0.084172
7 -0.099497  1.202204  0.213332  0.116505
8 -0.623300  0.169510 -0.383064 -0.052198
9  0.793634  0.618061 -0.126890  0.258992

In [85]:
pieces = [df[:3], df[3:7], df[7:]]

In [86]:
pd.concat(pieces)

          0         1         2         3
0  0.950582  0.183881  2.250567 -0.811921
1 -0.235128  0.791553 -0.625883 -1.725348
2 -0.907841  0.326129 -1.597208  0.110478
3 -0.631452 -0.518095 -0.728823 -0.177952
4 -1.335542  1.983912 -0.679510 -0.808348
5  0.007559  0.362327  0.396538 -0.456718
6  0.923302 -1.345448 -0.190447  0.084172
7 -0.099497  1.202204  0.213332  0.116505
8 -0.623300  0.169510 -0.383064 -0.052198
9  0.793634  0.618061 -0.126890  0.258992

In [87]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [88]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                             'two', 'two', 'one', 'three'],
                       'C': np.random.randn(8),
                       'D': np.random.randn(8)})

In [89]:
df

     A      B         C         D
0  foo    one -1.006513  0.659840
1  bar    one  0.119616  2.089190
2  foo    two -0.473241  0.903006
3  bar  three -0.677885  1.443487
4  foo    two -0.296537  0.979852
5  bar    two -0.846421 -0.731350
6  foo    one -1.780985  0.463005
7  foo  three  2.124364  0.452368

In [90]:
df.groupby('A').sum()

            C         D
A
bar -1.404690  2.801328
foo -1.432912  3.458072

In [91]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.119616  2.089190
    three -0.677885  1.443487
    two   -0.846421 -0.731350
foo one   -2.787498  1.122845
    three  2.124364  0.452368
    two   -0.769778  1.882859

In [92]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

In [93]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [94]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [95]:
df

                     A         B
first second
bar   one    -2.158452  0.449678
      two     1.297260  0.311106
baz   one     1.013848  0.396145
      two     0.178984  1.924348
foo   one    -0.028900 -0.065040
      two     0.419979  0.443422
qux   one    -0.300212 -0.355687
      two    -1.010631  1.742994

In [96]:
df2 = df[:4]

In [97]:
stacked = df2.stack()

In [98]:
stacked

first  second
bar    one     A   -2.158452
               B    0.449678
       two     A    1.297260
               B    0.311106
baz    one     A    1.013848
               B    0.396145
       two     A    0.178984
               B    1.924348
dtype: float64

In [99]:
stacked.unstack()

                     A         B
first second
bar   one    -2.158452  0.449678
      two     1.297260  0.311106
baz   one     1.013848  0.396145
      two     0.178984  1.924348

In [100]:
stacked.unstack(1)

second        one       two
first
bar   A -2.158452  1.297260
      B  0.449678  0.311106
baz   A  1.013848  0.178984
      B  0.396145  1.924348

In [101]:
stacked.unstack(0)

first          bar       baz
second
one    A -2.158452  1.013848
       B  0.449678  0.396145
two    A  1.297260  0.178984
       B  0.311106  1.924348

In [102]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                    'D': np.random.randn(12),
                    'E': np.random.randn(12)})

In [103]:
df

        A  B    C         D         E
0     one  A  foo -1.577163  0.363746
1     one  B  foo -0.693218  0.634158
2     two  C  foo  1.349818  0.377785
3   three  A  bar -1.240512  0.313206
4     one  B  bar -1.109144 -0.065123
5     one  C  bar -1.062642  1.212855
6     two  A  foo  1.098509  2.251587
7   three  B  foo  2.505360  1.177875
8     one  C  foo  0.629801 -2.089482
9     one  A  bar  1.280601 -1.627618
10    two  B  bar -0.395942 -0.642232
11  three  C  bar -0.236767  1.821973

In [104]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.280601 -1.577163
      B -1.109144 -0.693218
      C -1.062642  0.629801
three A -1.240512       NaN
      B       NaN  2.505360
      C -0.236767       NaN
two   A       NaN  1.098509
      B -0.395942       NaN
      C       NaN  1.349818

In [105]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [106]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [107]:
ts_utc = ts.tz_localize('UTC')

In [108]:
ts_utc.tz_convert('US/Eastern')

2011-12-31 19:00:00-05:00    0.922006
2011-12-31 19:00:01-05:00    0.555556
2011-12-31 19:00:02-05:00   -0.325563
2011-12-31 19:00:03-05:00    0.345107
2011-12-31 19:00:04-05:00   -0.243543
2011-12-31 19:00:05-05:00   -0.664679
2011-12-31 19:00:06-05:00    2.180239
2011-12-31 19:00:07-05:00   -0.652801
2011-12-31 19:00:08-05:00   -1.377496
2011-12-31 19:00:09-05:00    0.460005
2011-12-31 19:00:10-05:00    1.149495
2011-12-31 19:00:11-05:00    0.682462
2011-12-31 19:00:12-05:00   -0.739726
2011-12-31 19:00:13-05:00   -0.242197
2011-12-31 19:00:14-05:00    1.045401
2011-12-31 19:00:15-05:00   -0.838970
2011-12-31 19:00:16-05:00   -1.608197
2011-12-31 19:00:17-05:00    0.934855
2011-12-31 19:00:18-05:00    1.457222
2011-12-31 19:00:19-05:00    0.680055
2011-12-31 19:00:20-05:00   -0.981221
2011-12-31 19:00:21-05:00   -0.929373
2011-12-31 19:00:22-05:00   -0.519324
2011-12-31 19:00:23-05:00    0.170868
2011-12-31 19:00:24-05:00    0.033490
2011-12-31 19:00:25-05:00    2.047844
2011-12-31 19:00:26-05:00    1.451592
2011-12-31 19:00:27-05:00    0.671226
2011-12-31 19:00:28-05:00   -0.128977
2011-12-31 19:00:29-05:00    0.967127
                               ...
2011-12-31 19:01:10-05:00   -0.218468
2011-12-31 19:01:11-05:00   -0.687322
2011-12-31 19:01:12-05:00    0.165918
2011-12-31 19:01:13-05:00    0.400543
2011-12-31 19:01:14-05:00    1.912451
2011-12-31 19:01:15-05:00   -1.102849
2011-12-31 19:01:16-05:00    0.326975
2011-12-31 19:01:17-05:00    0.617660
2011-12-31 19:01:18-05:00   -1.208942
2011-12-31 19:01:19-05:00   -0.787148
2011-12-31 19:01:20-05:00    0.128120
2011-12-31 19:01:21-05:00    0.379364
2011-12-31 19:01:22-05:00    0.457822
2011-12-31 19:01:23-05:00   -0.452135
2011-12-31 19:01:24-05:00    0.056735
2011-12-31 19:01:25-05:00    1.005710
2011-12-31 19:01:26-05:00   -0.142966
2011-12-31 19:01:27-05:00    0.006329
2011-12-31 19:01:28-05:00    0.275864
2011-12-31 19:01:29-05:00    0.506050
2011-12-31 19:01:30-05:00    1.243018
2011-12-31 19:01:31-05:00    0.520231
2011-12-31 19:01:32-05:00   -0.569071
2011-12-31 19:01:33-05:00   -0.726256
2011-12-31 19:01:34-05:00   -0.349901
2011-12-31 19:01:35-05:00    1.238721
2011-12-31 19:01:36-05:00   -0.822310
2011-12-31 19:01:37-05:00    1.058562
2011-12-31 19:01:38-05:00   -0.171597
2011-12-31 19:01:39-05:00    0.355674
Freq: S, Length: 100, dtype: float64

In [109]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [110]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [111]:
ps = ts.to_period()

In [112]:
ps.to_timestamp()

2012-01-01   -0.209701
2012-02-01   -2.718642
2012-03-01    1.654761
2012-04-01    0.007201
2012-05-01    0.416189
Freq: MS, dtype: float64

In [113]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [114]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [115]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [116]:
ts.head()

1990-03-01 09:00   -0.299346
1990-06-01 09:00    0.314531
1990-09-01 09:00    0.026678
1990-12-01 09:00    0.663696
1991-03-01 09:00    0.296546
Freq: H, dtype: float64

In [117]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                       "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})

In [118]:
df["grade"] = df["raw_grade"].astype("category")

In [119]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [120]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [121]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium",
                                                  "good", "very good"])

In [122]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [123]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [124]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64